Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# simulator.webInspector.responses
source: Responses
ar: الاستجابات
de: Antworten
es: Respuestas
fr: Réponses
ja: レスポンス
ko: 응답
zh_hans: 响应
zh_hant: 回應

# simulator.webInspector.send
source: Send JSON
ar: إرسال JSON
de: JSON senden
es: Enviar JSON
fr: Envoyer le JSON
ja: JSONを送信
ko: JSON 전송
zh_hans: 发送 JSON
zh_hant: 傳送 JSON

# simulator.webInspector.truncatedResponse
source: Response truncated in this view
ar: تم اقتطاع الاستجابة في هذا العرض
de: Antwort in dieser Ansicht abgeschnitten
es: Respuesta truncada en esta vista
fr: Réponse tronquée dans cette vue
ja: このビューではレスポンスが省略されています
ko: 이 보기에서는 응답이 잘렸습니다
zh_hans: 响应在此视图中已截断
zh_hant: 此檢視中的回應已被截斷

# simulator.webInspector.unavailable
source: Web Inspector is unavailable for this Simulator
ar: مفتش الويب غير متاح لهذا المحاكي
de: Web-Inspektor ist für diesen Simulator nicht verfügbar
es: El inspector web no está disponible para este simulador
fr: L’inspecteur web n’est pas disponible pour ce simulateur
ja: このシミュレータではWebインスペクタを利用できません
ko: 이 시뮬레이터에서는 웹 검사기를 사용할 수 없습니다
zh_hans: 此模拟器不支持 Web 检查器
zh_hant: 此模擬器無法使用網頁檢查器

# simulator.webInspector.unhighlight
source: Remove Highlight
ar: إزالة التمييز
de: Hervorhebung entfernen
es: Quitar resaltado
fr: Supprimer la mise en surbrillance
ja: ハイライトを解除
ko: 강조 표시 제거
zh_hans: 移除高亮
zh_hant: 移除醒目提示

# sleepyMode.button.energy
source: Energy
ar: الطاقة
de: Energie
es: Energía
fr: Énergie
ja: エネルギー
ko: 에너지
zh_hans: 能耗
zh_hant: 能源

# sleepyMode.button.exit
source: Exit
ar: خروج
de: Beenden
es: Salir
fr: Quitter
ja: 終了
ko: 종료
zh_hans: 退出
zh_hant: 退出

# sleepyMode.button.lockMac
source: Lock Mac
ar: قفل Mac
de: Mac sperren
es: Bloquear Mac
fr: Verrouiller le Mac
ja: Mac をロック
ko: Mac 잠금
zh_hans: 锁定 Mac
zh_hant: 鎖定 Mac

# sleepyMode.button.lowPowerOff
source: Low Power: Off
ar: طاقة منخفضة: إيقاف
de: Stromsparmodus: Aus
es: Bajo consumo: desactivado
fr: Faible consommation : Désactivée
ja: 低電力: オフ
ko: 저전력 모드: 끔
zh_hans: 低功耗：关闭
zh_hant: 低耗電模式：關閉

# sleepyMode.button.lowPowerOn
source: Low Power: On
ar: طاقة منخفضة: تشغيل
de: Stromsparmodus: Ein
es: Bajo consumo: activado
fr: Faible consommation : Activée
ja: 低電力: オン
ko: 저전력 모드: 켬
zh_hans: 低功耗：开启
zh_hant: 低耗電模式：開啟

# sleepyMode.button.sleepDisplay
source: Sleep Display
ar: إسبات الشاشة
de: Display in Ruhezustand
es: Poner pantalla en reposo
fr: Mettre l’écran en veille
ja: ディスプレイをスリープ
ko: 디스플레이 잠자기
zh_hans: 显示器睡眠
zh_hant: 顯示器休眠

# sleepyMode.color.background
source: Background
ar: خلفية
de: Hintergrund
es: Fondo
fr: Arrière-plan
ja: 背景
ko: 배경
zh_hans: 背景
zh_hant: 背景

# sleepyMode.color.blush
source: Blush
ar: وردي خجل
de: Zartrosa
es: Rubor
fr: Rose poudré
ja: ほお
ko: 블러시
zh_hans: 腮红
zh_hant: 腮紅

# sleepyMode.color.cap
source: Nightcap
ar: قبعة النوم
de: Schlafmütze
es: Gorro de dormir
fr: Bonnet de nuit
ja: ナイトキャップ
ko: 나이트캡
zh_hans: 睡帽
zh_hant: 睡帽

# sleepyMode.color.eyes
source: Eyes
ar: العيون
de: Augen
es: Ojos
fr: Yeux
ja: 目
ko: 눈
zh_hans: 眼睛
zh_hant: 眼睛

# sleepyMode.color.face
source: Face
ar: الوجه
de: Gesicht
es: Cara
fr: Visage
ja: 顔
ko: 얼굴
zh_hans: 脸
zh_hant: 臉部

# sleepyMode.color.logo
source: Logo
ar: الشعار
ja: ロゴ
ko: 로고
zh_hans: 标志
zh_hant: 標誌

# sleepyMode.dismissHint
source: Touch ID or password to unlock
ar: استخدم Touch ID أو كلمة السر لإلغاء القفل
de: Touch ID oder Passwort zum Entsperren
es: Touch ID o contraseña para desbloquear
fr: Utilisez Touch ID ou votre mot de passe pour déverrouiller
ja: Touch ID またはパスワードでロック解除
ko: 잠금을 해제하려면 Touch ID 사용 또는 암호 입력
zh_hans: 使用触控 ID 或密码解锁
zh_hant: 使用 Touch ID 或密碼解鎖

# sleepyMode.dismissHintCasual
source: Press any key to wake (click the characters to play)
ar: اضغط على أي مفتاح للاستيقاظ (انقر على الشخصيات للعب)
de: Beliebige Taste drücken zum Aufwecken (Zeichen anklicken zum Spielen)
es: Pulsa cualquier tecla para activar (haz clic en los personajes para jugar)
fr: Appuyez sur n’importe quelle touche pour réveiller (cliquez sur les personnages pour jouer)
ja: 任意のキーで解除（キャラクターをクリックすると遊べます）
ko: 깨우려면 아무 키나 누르세요 (캐릭터를 클릭하여 플레이)
zh_hans: 按任意键唤醒（点击角色可以互动）
zh_hant: 按任意鍵以喚醒（點擊角色即可遊玩）

# sleepyMode.energy.automatic
source: Automatic
ar: تلقائي
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 자동
zh_hans: 自动
zh_hant: 自動

# sleepyMode.energy.high
source: High Power
ar: طاقة عالية
de: Hohe Leistung
es: Alto rendimiento
fr: Consommation élevée
ja: 高性能
ko: 고성능 모드
zh_hans: 高性能
zh_hant: 高功率

# sleepyMode.energy.low
source: Low Power
ar: طاقة منخفضة
de: Stromsparmodus
es: Bajo consumo
fr: Faible consommation
ja: 低電力
ko: 저전력 모드
zh_hans: 低功耗
zh_hant: 低耗電

# sleepyMode.glow.aurora
source: Aurora
ar: شفق قطبي
de: Polarlicht
fr: Aurore
ja: オーロラ
ko: 오로라
zh_hans: 极光
zh_hant: 極光

# sleepyMode.glow.black
source: Black
ar: أسود
de: Schwarz
es: Negro
fr: Noir
ja: ブラック
ko: 블랙
zh_hans: 黑色
zh_hant: 黑色

# sleepyMode.glow.custom
source: Custom
ar: مخصص
de: Benutzerdefiniert
es: Personalizado
fr: Sur mesure
ja: カスタム
ko: 맞춤형
zh_hans: 自定义
zh_hant: 自訂

# sleepyMode.glow.midnight
source: Midnight
ar: منتصف الليل
de: Mitternacht
es: Medianoche
fr: Minuit
ja: ミッドナイト
ko: 미드나이트
zh_hans: 午夜
zh_hant: 午夜

# sleepyMode.glow.ocean
source: Ocean
ar: المحيط
de: Ozean
es: Océano
fr: Océan
ja: オーシャン
ko: 오션
zh_hans: 海洋
zh_hant: 海洋

# sleepyMode.glow.sunset
source: Sunset
ar: الغروب
de: Sonnenuntergang
es: Atardecer
fr: Coucher de soleil
ja: サンセット
ko: 선셋
zh_hans: 日落
zh_hant: 日落

# sleepyMode.keepAwake
source: Mac staying awake
ar: إبقاء Mac مستيقظًا
de: Mac bleibt wach
es: El Mac permanecerá activo
fr: Le Mac reste éveillé
ja: Mac は起きたまま
ko: Mac 깨어 있는 상태 유지 중
zh_hans: Mac 保持唤醒
zh_hant: Mac 保持喚醒

# sleepyMode.keepAwake.failed
source: Couldn't keep Mac awake — check Battery settings
ar: تعذر إبقاء Mac مستيقظًا — تحقق من إعدادات البطارية
de: Mac konnte nicht wachgehalten werden — überprüfe die Batterieeinstellungen
es: No se pudo mantener el Mac activo; comprueba los ajustes de Batería
fr: Impossible d’empêcher la mise en veille du Mac — vérifiez les réglages de la batterie
ja: Mac を起きたままにできません — バッテリー設定を確認
ko: Mac을 깨어 있는 상태로 유지할 수 없습니다. 배터리 설정을 확인하세요.
zh_hans: 无法让 Mac 保持唤醒 — 请检查电池设置
zh_hant: 無法使 Mac 保持喚醒 — 請檢查「電池」設定

# sleepyMode.mascot.cat
source: Cat
ar: قطة
de: Katze
es: Gato
fr: Chat
ja: ねこ
ko: 고양이
zh_hans: 猫
zh_hant: 貓

# sleepyMode.mascot.cmux
source: cmux mascot
ar: تميمة cmux
de: cmux-Maskottchen
es: Mascota de cmux
fr: Mascotte cmux
ja: cmux マスコット
ko: cmux 마스코트
zh_hans: cmux 吉祥物
zh_hant: cmux 吉祥物

# sleepyMode.mascot.ghost
source: Ghost
ar: شبح
de: Geist
es: Fantasma
fr: Fantôme
ja: おばけ
ko: 유령
zh_hans: 幽灵
zh_hant: 幽靈

# sleepyMode.mascot.logoFace
source: Logo face
ar: وجه الشعار
de: Logo-Gesicht
es: Cara del logo
fr: Visage du logo
ja: ロゴフェイス
ko: 로고 얼굴
zh_hans: 标志脸
zh_hant: 標誌臉

# sleepyMode.settings.clock
source: Clock & date
ar: الساعة والتاريخ
de: Uhrzeit & Datum
es: Reloj y fecha
fr: Horloge et date
ja: 時計と日付
ko: 시계 및 날짜
zh_hans: 时钟与日期
zh_hant: 時鐘與日期

# sleepyMode.settings.glow
source: Background glow
ar: توهج الخلفية
de: Hintergrundleuchten
es: Brillo de fondo
fr: Lueur d’arrière-plan
ja: 背景のグロー
ko: 배경 글로우
zh_hans: 背景光晕
zh_hant: 背景發光

# sleepyMode.settings.lookSection
source: Look
ar: المظهر
de: Aussehen
es: Aspecto
fr: Apparence
ja: 外観
ko: 외형
zh_hans: 外观
zh_hant: 外觀

# sleepyMode.settings.mascot
source: Mascot
ar: التميمة
de: Maskottchen
es: Mascota
fr: Mascotte
ja: マスコット
ko: 마스코트
zh_hans: 吉祥物
zh_hant: 吉祥物

# sleepyMode.settings.moon
source: Moon
ar: القمر
de: Mond
es: Luna
fr: Lune
ja: 月
ko: 달
zh_hans: 月亮
zh_hant: 月亮

# sleepyMode.settings.pets
source: Agent pets
ar: حيوانات الوكيل الأليفة
de: Agenten-Haustiere
es: Mascotas de agentes
fr: Compagnons d’agents
ja: エージェントペット
ko: 에이전트 펫
zh_hans: 代理宠物
zh_hant: Agent 寵物

# sleepyMode.settings.pets.subtitle
source: Walks one cute pet for every Claude, Codex, and OpenCode agent you have running.
ar: يقوم بتنزيه حيوان أليف لطيف واحد لكل وكيل Claude وCodex وOpenCode قيد التشغيل لديك.
de: Führt für jeden deiner laufenden Claude-, Codex- und OpenCode-Agenten ein süßes Haustier Gassi.
es: Pasea una adorable mascota por cada agente Claude, Codex y OpenCode que tengas en ejecución.
fr: Fait promener un adorable compagnon pour chaque agent Claude, Codex et OpenCode en cours d’exécution.
ja: 実行中の Claude・Codex・OpenCode エージェントごとに、かわいいペットを歩かせます。
ko: 실행 중인 Claude, Codex, OpenCode 에이전트당 한 마리의 귀여운 펫이 산책합니다.
zh_hans: 为你正在运行的每个 Claude、Codex 和 OpenCode 代理放出一只可爱的宠物。
zh_hant: 為您每個執行中的 Claude、Codex 和 OpenCode Agent 遛一隻可愛的寵物。

# sleepyMode.settings.preview
source: Preview full screen
ar: معاينة بملء الشاشة
de: Vollbild-Vorschau
es: Previsualizar a pantalla completa
fr: Aperçu en plein écran
ja: 全画面でプレビュー
ko: 전체 화면 미리보기
zh_hans: 全屏预览
zh_hant: 預覽全螢幕

# sleepyMode.settings.previewRow
source: Preview
ar: معاينة
de: Vorschau
es: Avance
fr: Aperçu
ja: プレビュー
ko: 시사
zh_hans: 预览
zh_hant: 預覽

# sleepyMode.settings.previewRow.subtitle
source: Shows the scene full screen without locking; any key or click exits.
ar: يعرض المشهد بملء الشاشة دون قفل؛ الخروج بالضغط على أي مفتاح أو نقرة.
de: Zeigt die Szene im Vollbildmodus ohne Sperrung; jede Taste oder jeder Klick beendet sie.
es: Muestra la escena a pantalla completa sin bloquear; cualquier tecla o clic sale de ella.
fr: Affiche la scène en plein écran sans verrouiller ; n’importe quelle touche ou clic permet de quitter.
ja: ロックせず全画面で表示します。任意のキーまたはクリックで終了します。
ko: 잠금 없이 장면을 전체 화면으로 보여줍니다. 아무 키나 누르거나 클릭하면 종료됩니다.
zh_hans: 全屏显示场景但不锁定；按任意键或点击即可退出。
zh_hant: 以全螢幕顯示場景而不鎖定；按任意鍵或點擊即可退出。

# sleepyMode.settings.requireAuth
source: Require Touch ID to exit
ar: يتطلب Touch ID للخروج
de: Touch ID zum Beenden anfordern
es: Requerir Touch ID para salir
fr: Exiger Touch ID pour quitter
ja: 解除に Touch ID を要求
ko: 종료 시 Touch ID 요구
zh_hans: 退出时需要触控 ID
zh_hant: 退出時需要 Touch ID

# sleepyMode.settings.requireAuth.off
source: Casual screensaver. Any key or click wakes it.
ar: شاشة توقف عادية. أي مفتاح أو نقرة يوقظها.
de: Lockerer Bildschirmschoner. Jede Taste oder jeder Klick weckt ihn auf.
es: Salvapantallas informal. Cualquier tecla o clic lo activa.
fr: Écran de veille simple. N’importe quelle touche ou clic le réveille.
ja: 通常のスクリーンセーバー。任意のキーまたはクリックで解除します。
ko: 일반 화면 보호기입니다. 아무 키나 누르거나 클릭하면 깨어납니다.
zh_hans: 普通屏保。按任意键或点击即可唤醒。
zh_hant: 一般螢幕保護程式。按任意鍵或點擊即可喚醒。

# sleepyMode.settings.requireAuth.on
source: Locks the Mac. Blocks Cmd-Tab, Cmd-Q, and force-quit until you authenticate.
ar: يقفل جهاز Mac. يحظر Cmd-Tab و Cmd-Q والإنهاء الإجباري حتى تقوم بالمصادقة.
de: Sperrt den Mac. Blockiert Cmd-Tab, Cmd-Q und „Sofort beenden“, bis du dich authentifizierst.
es: Bloquea el Mac. Impide usar Cmd-Tab, Cmd-Q y forzar salida hasta que te autentiques.
fr: Verrouille le Mac. Bloque Cmd-Tab, Cmd-Q et la fermeture forcée jusqu’à ce que vous vous authentifiiez.
ja: Mac をロックします。認証するまで Cmd-Tab、Cmd-Q、強制終了をブロックします。
ko: Mac을 잠급니다. 인증할 때까지 Cmd-Tab, Cmd-Q, 강제 종료를 차단합니다.
zh_hans: 锁定 Mac。在你完成验证前会拦截 Cmd-Tab、Cmd-Q 和强制退出。
zh_hant: 鎖定 Mac。在您通過驗證之前，會封鎖 Cmd-Tab、Cmd-Q 和強制結束。

# sleepyMode.settings.sceneSection
source: Scene
ar: المشهد
de: Szene
es: Escena
fr: Scène
ja: シーン
ko: 장면
zh_hans: 场景
zh_hant: 場景

# sleepyMode.settings.securityNote
source: About security
ar: حول الأمان
de: Über Sicherheit
es: Acerca de la seguridad
fr: À propos de la sécurité
ja: セキュリティについて
ko: 보안 정보
zh_hans: 关于安全性
zh_hant: 關於安全性

# sleepyMode.settings.securityNote.subtitle
source: Sleepy Mode is a screensaver, not a lock — any key wakes it. For real security, use the “Lock Mac” button in the scene, which engages the actual macOS login lock.
ar: وضع النوم (Sleepy Mode) هو شاشة توقف وليس قفلاً — أي مفتاح يوقظه. للأمان الحقيقي، استخدم زر “قفل Mac” في المشهد، والذي يقوم بتشغيل قفل تسجيل الدخول الفعلي لنظام macOS.
de: Der Sleepy Mode ist ein Bildschirmschoner, keine Sperre — jede Taste weckt ihn auf. Verwende für echte Sicherheit die Schaltfläche „Mac sperren“ in der Szene, die die tatsächliche macOS-Anmeldesperre aktiviert.
es: Sleepy Mode es un salvapantallas, no un bloqueo; cualquier tecla lo desactiva. Para una seguridad real, usa el botón “Bloquear Mac” de la escena, que activa el bloqueo de inicio de sesión real de macOS.
fr: Le mode Veille (Sleepy Mode) est un écran de veille, pas un verrouillage — n’importe quelle touche le réveille. Pour une véritable sécurité, utilisez le bouton « Verrouiller le Mac » dans la scène, qui active le véritable verrouillage de session macOS.
ja: おやすみモードはロックではなくスクリーンセーバーです（任意のキーで解除）。本当のセキュリティが必要な場合は、画面内の「Mac をロック」ボタンを使うと、実際の macOS ログインロックがかかります。
ko: Sleepy Mode는 화면 보호기이며 잠금 장치가 아닙니다. 아무 키나 누르면 깨어납니다. 완전한 보안을 위해 실제 macOS 로그인 잠금을 활성화하는 화면 내 “Mac 잠금” 버튼을 사용하십시오.
zh_hans: 睡眠模式是屏保而不是锁屏 — 按任意键即可唤醒。若需要真正的安全保护，请使用场景中的「锁定 Mac」按钮，它会启用 macOS 真正的登录锁定。
zh_hant: Sleepy Mode 是螢幕保護程式，而非鎖定功能 — 按任意鍵即可喚醒。若要獲得真正的安全性，請使用場景中的「鎖定 Mac」按鈕，這會啟動實際的 macOS 登入鎖定。

# sleepyMode.settings.securitySection
source: Security
ar: الأمان
de: Sicherheit
es: Seguridad
fr: Sécurité
ja: セキュリティ
ko: 보안
zh_hans: 安全性
zh_hant: 安全性

# sleepyMode.settings.stars
source: Stars
ar: النجوم
de: Sterne
es: Estrellas
fr: Étoiles
ja: 星
ko: 별
zh_hans: 星星
zh_hant: 星星

# sleepyMode.settings.start
source: Start Sleepy Mode
ar: بدء وضع النوم (Sleepy Mode)
de: Sleepy Mode starten
es: Iniciar Sleepy Mode
fr: Démarrer Sleepy Mode
ja: おやすみモードを開始
ko: Sleepy Mode 시작
zh_hans: 启动睡眠模式
zh_hant: 啟動 Sleepy Mode

# sleepyMode.settings.startRow
source: Start Sleepy Mode now
ar: ابدأ وضع النوم (Sleepy Mode) الآن
de: Sleepy Mode jetzt starten
es: Iniciar Sleepy Mode ahora
fr: Démarrer Sleepy Mode maintenant
ja: 今すぐおやすみモードを開始
ko: 지금 Sleepy Mode 시작
zh_hans: 立即启动睡眠模式
zh_hant: 立即啟動 Sleepy Mode

# sleepyMode.settings.startRow.subtitle
source: Engages Sleepy Mode using the settings above.
ar: يقوم بتشغيل وضع النوم (Sleepy Mode) باستخدام الإعدادات المذكورة أعلاه.
de: Aktiviert den Sleepy Mode mit den obigen Einstellungen.
es: Activa Sleepy Mode usando los ajustes anteriores.
fr: Active Sleepy Mode en utilisant les réglages ci-dessus.
ja: 上記の設定でおやすみモードを開始します。
ko: 위의 설정을 사용하여 Sleepy Mode를 실행합니다.
zh_hans: 按以上设置启用睡眠模式。
zh_hant: 使用上述設定啟用 Sleepy Mode。

# sleepyMode.settings.status
source: Battery & Wi-Fi
ar: البطارية وWi-Fi
de: Batterie & WLAN
es: Batería y Wi-Fi
fr: Batterie et Wi-Fi
ja: バッテリーと Wi-Fi
ko: 배터리 및 Wi-Fi
zh_hans: 电池与 Wi-Fi
zh_hant: 電池與 Wi-Fi

# sleepyMode.settings.theme
source: Theme
ar: السمة
de: Design
es: Tema
fr: Thème
ja: テーマ
ko: 테마
zh_hans: 主题
zh_hant: 主題

# sleepyMode.settings.title
source: Sleepy Mode
ar: وضع الخمول
de: Schlafmodus
es: Modo somnoliento
fr: Mode veille
ja: おやすみモード
ko: 슬리피 모드
zh_hans: 睡眠模式
zh_hant: 睡眠模式

# sleepyMode.settings.zs
source: Floating z z z
ar: رموز z z z عائمة
de: Schwebende z z z
es: Z z z flotantes
fr: z z z flottants
ja: ただよう z z z
ko: 떠다니는 z z z
zh_hans: 漂浮的 z z z
zh_hant: 漂浮的 z z z

# sleepyMode.theme.blossom
source: Blossom
ar: أزهار
de: Blüte
es: Flor
fr: Floraison
ja: ブロッサム
ko: 블라썸
zh_hans: 花朵
zh_hant: 櫻花

# sleepyMode.theme.custom
source: Custom
ar: مخصص
de: Benutzerdefiniert
es: Personalizado
fr: Sur mesure
ja: カスタム
ko: 맞춤형
zh_hans: 自定义
zh_hant: 自訂

# sleepyMode.theme.mint
source: Mint
ar: نعناع
de: Minze
es: Menta
fr: Menthe
ja: ミント
ko: 민트
zh_hans: 薄荷
zh_hant: 薄荷

# sleepyMode.theme.mono
source: Mono
ar: أحادي
ja: モノ
ko: 모노
zh_hans: 单色
zh_hant: 單色

# sleepyMode.unlockCancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# sleepyMode.unlockReason
source: Unlock cmux Sleepy Mode
ar: إلغاء قفل وضع النوم لـ cmux
de: cmux Sleepy Mode entsperren
es: Desbloquear Sleepy Mode de cmux
fr: Déverrouiller le Sleepy Mode de cmux
ja: cmux おやすみモードのロックを解除
ko: cmux Sleepy Mode 잠금 해제
zh_hans: 解锁 cmux 睡眠模式
zh_hant: 解鎖 cmux Sleepy Mode

# socket.cloudVM.authRequired
source: Cloud VM access requires sign-in. Run `cmux auth login`, then retry.
ar: يتطلب الوصول إلى الآلة الافتراضية السحابية تسجيل الدخول. قم بتشغيل `cmux auth login` ثم أعد المحاولة.
de: Der Zugriff auf die Cloud-VM erfordert eine Anmeldung. Führe `cmux auth login` aus und versuche es erneut.
es: El acceso a la VM en la nube requiere iniciar sesión. Ejecute `cmux auth login` y vuelva a intentarlo.
fr: L’accès aux VM Cloud nécessite une connexion. Exécutez `cmux auth login`, puis réessayez.
ja: Cloud VMを利用するにはサインインが必要です。`cmux auth login`を実行してから再試行してください。
ko: 클라우드 VM에 액세스하려면 로그인이 필요합니다. `cmux auth login`을 실행한 다음 다시 시도하십시오.
zh_hans: 访问 Cloud VM 需要登录。请运行 `cmux auth login` 后重试。
zh_hant: 存取雲端 VM 需要登入。請執行 `cmux auth login`，然後重試。

# socket.cloudVM.domain.nameRequired
source: vm.domain_verify requires `name` (a domain).
ar: يتطلب vm.domain_verify توفير `name` (نطاق).
de: vm.domain_verify erfordert `name` (eine Domain).
es: `vm.domain_verify` requiere `name` (un dominio).
fr: vm.domain_verify requiert `name` (un domaine).
ja: vm.domain_verify には `name`（ドメイン）が必要です。
ko: vm.domain_verify에는 `name` (도메인)이 필요합니다.
zh_hans: vm.domain_verify 需要 `name`（一个域名）。
zh_hant: vm.domain_verify 需要 `name` (網域)。

# socket.cloudVM.publication.create.invalidPort
source: vm.publication_create requires `port` between 1 and 65535.
ar: يتطلب vm.publication_create توفير `port` بين 1 و 65535.
de: vm.publication_create erfordert `port` zwischen 1 and 65535.
es: `vm.publication_create` requiere un `port` entre 1 y 65535.
fr: vm.publication_create requiert `port` compris entre 1 et 65535.
ja: vm.publication_create には 1 から 65535 の `port` が必要です。
ko: vm.publication_create에는 1에서 65535 사이의 `port`가 필요합니다.
zh_hans: vm.publication_create 需要 1 到 65535 之间的 `port`。
zh_hant: vm.publication_create 需要介於 1 到 65535 之間的 `port`。

# socket.cloudVM.publication.create.missingVM
source: vm.publication_create requires `vmId`.
ar: يتطلب vm.publication_create توفير `vmId`.
de: vm.publication_create erfordert `vmId`.
es: `vm.publication_create` requiere `vmId`.
fr: vm.publication_create requiert `vmId`.
ja: vm.publication_create には `vmId` が必要です。
ko: vm.publication_create에는 `vmId`가 필요합니다.
zh_hans: vm.publication_create 需要 `vmId`。
zh_hant: vm.publication_create 需要 `vmId`。

# socket.cloudVM.publication.idRequired
source: A publication id is required.
ar: معرّف المنشور مطلوب.
de: Eine Publikations-ID ist erforderlich.
es: Se requiere un id de publicación.
fr: Un ID de publication est requis.
ja: 公開 ID が必要です。
ko: 게시(publication) ID가 필요합니다.
zh_hans: 需要提供发布 id。
zh_hant: 需要發布 ID。

# socket.cloudVM.publication.invalidAccess
source: %@ requires `accessMode` to be personal, team, or public.
ar: يتطلب %@ أن يكون `accessMode` إما personal أو team أو public.
de: %@ erfordert, dass `accessMode` „personal“, „team“ oder „public“ ist.
es: %@ requiere que `accessMode` sea personal, team o public.
fr: %@ requiert que `accessMode` soit personal, team ou public.
ja: %@ の `accessMode` は personal、team、または public で指定してください。
ko: %@에는 `accessMode`가 personal, team 또는 public이어야 합니다.
zh_hans: %@ 要求 `accessMode` 为 personal、team 或 public。
zh_hant: %@ 需要 `accessMode` 為 personal、team 或 public。

# socket.cloudVM.publication.teamOnly
source: %@ accepts `teamId` only when `accessMode` is team.
ar: يقبل %@ المعرّف `teamId` فقط عندما يكون `accessMode` هو team.
de: %@ akzeptiert `teamId` nur, wenn `accessMode` „team“ ist.
es: %@ acepta `teamId` solo cuando `accessMode` es team.
fr: %@ n'accepte `teamId` que lorsque `accessMode` est team.
ja: %@ で `teamId` を指定できるのは、`accessMode` が team の場合のみです。
ko: %@은 `accessMode`가 team인 경우에만 `teamId`를 허용합니다.
zh_hans: 只有当 `accessMode` 为 team 时，%@ 才接受 `teamId`。
zh_hant: 僅當 `accessMode` 為 team 時，%@ 才接受 `teamId`。

# socket.cloudVM.publication.teamRequired
source: %@ requires `teamId` when `accessMode` is team.
ar: يتطلب %@ المعرّف `teamId` عندما يكون `accessMode` هو team.
de: %@ erfordert `teamId`, wenn `accessMode` „team“ ist.
es: %@ requiere `teamId` cuando `accessMode` es team.
fr: %@ requiert `teamId` lorsque `accessMode` est team.
ja: %@ で `accessMode` が team の場合は `teamId` が必要です。
ko: %@에는 `accessMode`가 team일 때 `teamId`가 필요합니다.
zh_hans: 当 `accessMode` 为 team 时，%@ 需要 `teamId`。
zh_hant: 當 `accessMode` 為 team 時，%@ 需要 `teamId`。

# socket.vm.portOpen.invalidTarget
source: vm.port_open: invalid explicit target `%@`.
ar: vm.port_open: الهدف الصريح غير صالح `%@`.
de: vm.port_open: Ungültiges explizites Ziel „%@“.
es: vm.port_open: destino explícito no válido `%@`.
fr: vm.port_open : cible explicite non valide `%@`.
ja: vm.port_open: 明示的なターゲット `%@` が無効です。
ko: vm.port_open: 잘못된 명시적 대상 `%@`입니다.
zh_hans: vm.port_open: 显式目标 `%@` 无效。
zh_hant: vm.port_open: 無效的明確目標 `%@`。

# socket.cloudVM.sessionRejected
source: The cmux Cloud service rejected this session. Run `cmux auth logout`, then `cmux auth login`, and retry.
ar: رفضت خدمة cmux السحابية هذه الجلسة. قم بتشغيل `cmux auth logout` ثم `cmux auth login` وأعد المحاولة.
de: Der cmux-Cloud-Dienst hat diese Sitzung abgelehnt. Führe `cmux auth logout`, dann `cmux auth login` aus und versuche es erneut.
es: El servicio cmux Cloud rechazó esta sesión. Ejecute `cmux auth logout`, luego `cmux auth login` y vuelva a intentarlo.
fr: Le service cmux Cloud a rejeté cette session. Exécutez `cmux auth logout`, puis `cmux auth login`, et réessayez.
ja: cmux Cloud サービスがこのセッションを拒否しました。`cmux auth logout` を実行してから `cmux auth login` を実行し、再試行してください。
ko: cmux 클라우드 서비스가 이 세션을 거부했습니다. `cmux auth logout`을 실행한 다음 `cmux auth login`을 실행하고 다시 시도하십시오.
zh_hans: cmux Cloud 服务拒绝了此会话。请依次运行 `cmux auth logout` 和 `cmux auth login` 后重试。
zh_hant: cmux 雲端服務拒絕了此工作階段。請執行 `cmux auth logout`，然後執行 `cmux auth login` 並重試。

# socket.vm.renameFailed
source: The remote name could not be changed. Refresh and try again.
ar: تعذر تغيير الاسم عن بُعد. أعد التحميل وحاول مرة أخرى.
de: Der Remote-Name konnte nicht geändert werden. Aktualisiere und versuche es erneut.
es: No se pudo cambiar el nombre remoto. Actualice y vuelva a intentarlo.
fr: Le nom distant n’a pas pu être modifié. Actualisez et réessayez.
ja: リモート名を変更できませんでした。更新して再試行してください。
ko: 원격 이름을 변경할 수 없습니다. 새로고침한 후 다시 시도하십시오.
zh_hans: 无法更改远程名称。请刷新后重试。
zh_hant: 無法變更遠端名稱。請重新整理並重試。

# socket.vm.renameTimedOut
source: The remote rename timed out after 120 seconds. Refresh and try again.
ar: انتهت مهلة إعادة التسمية عن بُعد بعد 120 ثانية. أعد التحميل وحاول مرة أخرى.
de: Die Remote-Umbenennung ist nach 120 Sekunden fehlgeschlagen (Zeitüberschreitung). Aktualisiere und versuche es erneut.
es: Se agotó el tiempo de espera para el cambio de nombre remoto después de 120 segundos. Actualice y vuelva a intentarlo.
fr: La modification du nom distant a expiré après 120 secondes. Actualisez et réessayez.
ja: リモート名の変更が120秒でタイムアウトしました。更新して再試行してください。
ko: 원격 이름 변경 요청이 120초 후 시간 초과되었습니다. 새로고침한 후 다시 시도하십시오.
zh_hans: 远程重命名在 120 秒后超时。请刷新后重试。
zh_hant: 遠端重新命名在 120 秒後逾時。請重新整理並重試。

# socket.client.accessDenied
source: Access denied - only processes started inside cmux can connect
ar: تم رفض الوصول - يمكن فقط للعمليات التي بدأت داخل cmux الاتصال
de: Zugriff verweigert – nur innerhalb von cmux gestartete Prozesse können eine Verbindung herstellen
es: Acceso denegado: solo los procesos iniciados dentro de cmux pueden conectarse
fr: Accès refusé - seuls les processus démarrés dans cmux peuvent se connecter
ja: アクセスが拒否されました。cmux 内で起動されたプロセスのみ接続できます
ko: 액세스 거부됨 - cmux 내부에서 시작된 프로세스만 연결할 수 있습니다
zh_hans: 访问被拒绝 - 只有在 cmux 内启动的进程才能连接
zh_hant: 存取被拒 - 僅限在 cmux 內部啟動的程序才能連線

# socket.client.verificationFailed
source: Unable to verify client process
ar: تعذر التحقق من عملية العميل
de: Client-Prozess konnte nicht verifiziert werden
es: No se pudo verificar el proceso cliente
fr: Impossible de vérifier le processus client
ja: クライアントプロセスを確認できません
ko: 클라이언트 프로세스를 확인할 수 없습니다
zh_hans: 无法验证客户端进程
zh_hant: 無法驗證用戶端程序
